<?php

namespace Larabookir\Gateway\Zarinpal;

use Larabookir\Gateway\Exceptions\BankException;

class ZarinpalException extends BankException
{
    public static $errors = array(
        -1 => 'اطلاعات ارسال شده ناقص است.',
		-2 => 'IP و یا مرچنت کد پذیرنده صحیح نیست',
        -3 => 'رقم باید بالای 100 تومان باشد',
        -4 => 'سطح پذیرنده پایین تر از سطح نقره ای است',
        -11 => 'درخواست مورد نظر یافت نشد',
        -21 => 'هیچ نوع عملیات مالی برای این تراکنش یافت نشد',
        -22 => 'تراکنش ناموفق میباشد',
        -33 => 'رقم تراکنش با رقم پرداخت شده مطابقت ندارد',
        -54 => 'درخواست مورد نظر آرشیو شده',
        100 => 'عملیات با موفقیت انجام شد',
        101 => 'عملیات پرداخت با موفقیت انجام شده ولی قبلا عملیات PaymentVertification بر روی این تراکنش انجام شده است',
        -9 => '	خطای اعتبار سنجی',
        -10 => 'ای پی و يا مرچنت كد پذيرنده صحيح نيست',
        -11 => ' مرچنت کد فعال نیست لطفا با تیم پشتیبانی ما تماس بگیرید',
        -12 => 'تلاش بیش از حد در یک بازه زمانی کوتاه.',
        -15 => 'ترمینال شما به حالت تعلیق در آمده با تیم پشتیبانی تماس بگیرید',
        -16 => 'سطح تاييد پذيرنده پايين تر از سطح نقره اي است.',
        -30 => 'اجازه دسترسی به تسویه اشتراکی شناور ندارید',
        -31 => 'حساب بانکی تسویه را به پنل اضافه کنید مقادیر وارد شده واسه تسهیم درست نیست',
        -32 => 'Wages is not valid, Total wages(floating) has been overload max amount.	',
        -33 => 'درصد های وارد شده درست نیست',
        -34 => 'مبلغ از کل تراکنش بیشتر است',
        -35 => 'تعداد افراد دریافت کننده تسهیم بیش از حد مجاز است',
        -40 => 'Invalid extra params, expire_in is not valid.	',
        -50 => 'مبلغ پرداخت شده با مقدار مبلغ در وریفای متفاوت است',
        -51 => 'پرداخت ناموفق',
        -52 => 'خطای غیر منتظره با پشتیبانی تماس بگیرید',
        -53 => 'اتوریتی برای این مرچنت کد نیست',
        -54 => 'اتوریتی نامعتبر است',
    );

    public function __construct($errorId)
    {
        $this->errorId = intval($errorId);

        parent::__construct((isset(self::$errors[$this->errorId]) ? self::$errors[$this->errorId] : '').' #'.$this->errorId, $this->errorId);
    }
}
